# list, tuple

# 자료들의 자료형, 순서가 있다.(연속적이다(subscriptable))
# 대[]괄호를 사용하면 리스트, 소()괄호를 사용하면 튜플

# 튜플 : 자료가 하나만 존재하실 그 자료형으로 형변환이 되므로 꼭 ,를 찍자!
# tu = (1,)

# 순서가 있는 자료형 : string, list, tuple
# 순서란 : index(0부터 시작) [1,2,3] -> index [0,1,2] 

# heros = ["1.아이언맨", "2.스파이더맨", "3.토르", "4.헐크"]
# print(heros)

# user = int(input("영웅을 선택하세요 : "))

# print(heros[user-1], "선택!!")

# 인간의 입장에선 0번이 1번이기에 -1을 해주어야 한다

# ----------------------------------------------------------------------------------------------------

# li = [1,2,3]
# li[0] = "one"
# print(li)

# tu = (1,2,3)
# tu[0] = "one"

# 리스트는 생성한 후 변경 가능!
# 튜플은 생성됐을 때의 값을 그대로 가지고 간다!! 

# ----------------------------------------------------------------------------------------------------

# 리스트 일때만 사용할 수 있는 표현들!

# li = []

# 1. 자료 맨 뒤에 추가
# li.append(x)

# li.append(10)
# print(li)
# li.append("hello")
# print(li)
# li.append(True)
# print(li)

# ----------------------------------------------------------------------------------------------------

# 2. 자료 원하는 위치 추가
# li.insert(idx, x) idx 위치에 x를 추가함

# li.insert(0, "1.2")
# print(li)

# ----------------------------------------------------------------------------------------------------

# 3. 원하는 위치 자료 제거 및 반환
# li.pop(idx) idx 위치에 자료를 제거 (default(아무것도 안넣음)는 맨 뒤)

# li.pop(1)
# print(li)
# print(li.pop())
# x = li.pop(1)
# print(x,"가 제거된 리스트",li)

# ----------------------------------------------------------------------------------------------------

# 4. 리스트 내 자료의 개수를 반환
# li.count(x)

# li2 = [1,1,1,1,11,1,1,1,1,1,11,1,1,1,1,1,1,1,1,1]
# print(li2.count(1)) # 1의 개수를 반환
# x = li2.count(1)
# print(x)

# ----------------------------------------------------------------------------------------------------

# 5. 원하는 자료의 index를 반환
# # list.index(x) x의 index를 반환

# idx = li2.index(11)
# print(11,"의 위치",idx)

# ----------------------------------------------------------------------------------------------------

# 번외문제

# words = ["apple","banana","air"]
# print(words)
# a = input("삭제할 단어를 입력해주세요 : ")
# if words.count(a):
#     c = words.index(a)
#     b = words.pop(c)
#     print("입력한",b,"가 사전에서 삭제됩니다")
#     print(words)
# else:
#     print("그런 단어 없음!")
#     print(words)

# ----------------------------------------------------------------------------------------------------

# 6. list의 정렬
# li.sort() 단, 자료형이 서로 일치할 경우만!

# li3 = [10,1.2,3,20,1,39,22,10.32]
# li3.sort()
# print(li3)
# li4 = ["a","A","@","가","마"]
# li4.sort(reverse=True)
# print(li4)

# ----------------------------------------------------------------------------------------------------

# 7. list 비우기
# list.clear()

# li3.clear()
# li4.clear()
# print(li3,li4)

# ----------------------------------------------------------------------------------------------------

# list 사용시 유용한 함수
# li =[1,2,345,5,2,34,23,2,321,321,421,4214,15343221,6813,574,78,64,253]

# list._____ -> list여야만 할 수 있는 것!
# len, sum
# len(list) -> 자료의 개수 반환
# sum(list) -> 자료의 합
# print(len(li))
# print(sum(li))
# print(len(li)/sum(li)) # -> 리스트 내의 평균(같은 자료형일 경우)

# ----------------------------------------------------------------------------------------------------

# 반복문(for___ in __ :)

# for i in ["a","b","c"]:
#     print(i)

# for i in [1,2,3,4,5,6,7,8,9,10]:
#     print(i)
# i를 len[1,2,3,4,5,6,7,8,9,10] 만큼 반복
# i를 출력(종속문장)
# print(1), print(2), print(3), ... , print(10)

# li = [30,True,"hello",2,"b,c"]

# for i in li:
#     print(i)

# ----------------------------------------------------------------------------------------------------

# 범위설정

# range(start:0,stop,step:1) -> start <= i < stop ,i++
# range(40) -> range(0,40,1)
# range(21,55) -> range(21,55,1)
# range(21,30,3) -> range(21,30,3)
# range(13) -> 0,1,2,3,4,5,6,7,8,9,10,11,12
# range(34,82) -> 34,35,36,37,...,80,81
# range(32,40,2) -> 32,34,36,38
# 0 ~ 21 -> range(22)
# 41 ~ 52 -> range(41,53)
# 10 ~ 999 -> range(10,1000)

# ----------------------------------------------------------------------------------------------------
# 1에서 1000까지 출력하기

# for i in range(1,1001):
#     print(i)

# ----------------------------------------------------------------------------------------------------
# 1에서부터 n 까지 출력하기

# n = int(input("n : "))

# for i in range(1,n+1):
#     print(i)

# ----------------------------------------------------------------------------------------------------
# n에서부터 1까지 출력하기
# n = int(input("n : "))

# for i in range(n,0,-1):
#     print(i)

# ----------------------------------------------------------------------------------------------------
# 입력 받은 두 수 사이의 정수 출력
# A = int(input("A 입력 : "))
# B = int(input("B 입력 : "))
# # range를 빼먹었을땐 tuple로 바뀌기 때문에 항상 체크하기!

# if A>B:
#     for i in range(A-1,B,-1):
#         print(i)
# elif A<B:
#     for i in range(A+1,B,1):
#         print(i)
# else:
#     print("두 수가 같으므로 사이의 정수가 존재하지 않음!")

# ----------------------------------------------------------------------------------------------------
# 복합연산자

# 기존의 변수에 = 오른쪽의 값만큼 연산자로 대입한다
# a+= 3 -> a = a + 3

# 주의사항
# 기존의 변수를 정의해야한다!
# a =3
# a += 3
# -> a = 6

# ----------------------------------------------------------------------------------------------------
# 1에서 n까지의 합 구하기

# n = int(input("n 입력 : "))

# for i in range(0,n):
#     n += i
# print(n)

# 정식 답안

# n = int(input("n 입력 : "))
# su = 0
# for i in range(0,n+1):
#     su += i
# print(su)

# ----------------------------------------------------------------------------------------------------
# 팩토리얼 프로그램 짜기

n = int(input("n 입력 : "))
fa = 1
for i in range (1,n+1):
    fa *= i
print(fa)
