#input("입력 : ") # 입력이 들어오면 해당 값을 반환

# print(input(" 입력 : ")) -> 반환된 값을 화면에 출력하기

# x = input("입력 : ") # 입력이 들어오면 해당 변수를 x변수에 대입
# print(x, "를 입력함!!") -> 출력 응용

# x= input("이름 : ") # name -> x변수의 정의를 모르기 때문에 주석(#)을 달거나 변수의 이름을 알아보기 쉽게 변경하기
# y= input("나이 : ") # age
# z= input("이메일 : ") # email

# print("이름 : ",x,"\n나이 : ",y,"\n이메일 : ",z)


# num1 = input("첫번째 숫자 : ")        |
# num2 = input("두번째 숫자 : ")        |
# num1 = int(num1)                      -> 맨 처음에 int를 씌우면 편하게 해결할 수 있다. num1 = int(input("첫번째 숫자 : "))
# num2 = int(num2)                      |
# print("두 수의 합 : ",num1 + num2)
# print("두 수의 차 : ",num1 - num2)
# print("두 수의 곱 : ",num1 * num2)

# input(문자열) 이기때문에 +나 -나 *를 적용시킬 수 없다. 따라서 형변환을 시켜주어야 한다.
# 변수 = 자료형(변수)
# 형변환(형변환) 도 가능하다. "7.8" -> int(float("7.8"))
